org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** TODO One Week Backpacking Trip                     :backpacking:@Stories:
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: one-week-backpacking-trip
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-12-26 Sat 18:55]--[2020-12-26 Sat 19:14] =>  0:19
CLOCK: [2020-12-26 Sat 17:43]--[2020-12-26 Sat 18:06] =>  0:23
CLOCK: [2020-12-26 Sat 16:41]--[2020-12-26 Sat 17:43] =>  1:02
:END:

*** Overview

This past summer I went on my first backpacking trip with two friends from highschool: Soren and Thomas. Soren and Thomas had backpacked before, but it was my first time. We hiked just about 100 miles over the course of 7 days!

The point of this post is to share what it might be like to go backpacking, and to provide entertainement value.

I haven't made it entertaining though. It's just a bullet point of things. You would never read a story that is a bullet point of events. You have to tie everything together. But I'm not ready for that right now.

*** Preparation

- I found my backpacking backpack on the side of the road left out for the trash. At first we weren't sure if it was going to cut it, but it worked out fine in the end (although it was heavy, creeked a lot, put a sharp pressure on hips, and fabric coming apart onto anything you put into the bag).
- We did one practice hike where we walked around cambridge with heavy water jugs in our backpacks.
- Thomas and I were vegetarian for the trip. We packed food which consisted primarily of freeze dried food, cliff bars, granola bars, and a jar of peanut butter.

*** Day 1

- Woke up at 7. Soren, Thomas, and I had done a practice camping on the roof of my house.
- We drove over to Soren's house where we had eggs for breakfast.
- Laurentiu is driving. Quite the character. I remember there was one close incident, but can't remember exactly what it was.
- Stop at a gas station on the way where I get this notebook. I'm so glad I did.
- Arrive at the trail head. We start off, ready to go.
- The parents hike along behind us for about 30 minutes, but they can't keep up. We are on our own!
- I wear a single shirt and pants for the 7 days.
- We reach the summit of the first ascent. It's the top of a ski lift. Beautiful. Change from pants to shorts.
- We see a trail resorer. We chat with him for a bit. He has a machette that he cuts down trail obstructions with. He notices our high morals and says that our morals are high because we haven't gotten wet yet.
- We go down from the ski lift. We see a pack of 6 girls. I didn't realize this was the first day. They were going to the opposite direction. One of them was wearing a McGill shirt so I said "wow I got to McGill too".
- After we pass them I start saying "We should've asked...", but then stop myself because I realize that I was trying to spread the "blame" when really it was entirely up to me to ask them a question. I wanted to ask them the details of their hike and how it was going.
- We summit a second mountain and stop for our first snack. Feels really good. We are eating at the top.
- We find our first stream and filter some water. While filtering water soren got out his ukelele and we started making up some songs together. Good times.
- We continue to the campsite. Set up the tent. The first freeze dried meals!
- An old man tells us to stay at this campsie instead of continuing forwards.
- We eat our meals by the river.
- Once it gets dark, we skinny dip in the river. It was very shallow so it was more of a pushup and spin move haha. First swim on the first day!
- We put our food in a nearby bear box.
- We sleep. Takes me a while to fall asleep, but pretty good.

