content/posts/one-week-backpacking-trip/index.md


# Day 2 {#day-2}

-   Wake up and east some musli. It's a food very similar to overnight oats.
-   We pack up the tent. I am trying to squeeze it against the trunk of a tree to speed up the flow of water. A branch punctures the water filter! It's the second morning lol.
-   We continue forward, eventually reaching a lake.
-   Thomas goes swimming nakes. Some rangers pass by and we chat with them while thomas is hiding the lower half of his body in the water. It's difficult though because the lake is super shallow haha. Thomas didn't realize when he was first getting in. What a small world; turns out Thomas and Soren competed against the rangers in the MA sailing team league.
-   We climb a mountain. Thomas calls with crystal. I get a selfie video on top of the mountain using a mini tripod I brought. Glad I brought it.
-   We continue forward. We are ascending a mountain and keep thinking we are about to summit, but we never do.
-   We finally get to the top and find a bunch of stacked rocks. There wasn't much of a view here. We rest for a bit and eat some snacks.
-   We start descending. Soren thinks he saw the shelter so we all get our hopes up, but turns out it was just a really big rock.
-   We are getting quite thirst and are out of water. Soren thinks he sees a river, but it's a mirage. Just some more rocks haha.
-   We find a shelter with gross mosquito water, but it's kind of running. We filter some of it, make a wood fire and cook our meals. We lay down the tent and a tarp.
-   We decide that there is still enough daylight that we want to continue forwards to make up for the below expected miles we hiked on the first day.
-   We are all kind of delerious from the lack of water and are laughing somewhat hysterically at the smallest things. Thomas thinks we are jokin about resuming hiking, but we pack up and go.
-   We find a marking on the ground that says "Pinta People". We discuss for a while what it could possible mean.
-   We find a humongous river like the potomac and fill the big water filter with water but keep going instead of filtering because it is starting to get dark. This is the popped water filter, but we covered the hole with duct tape which works well enough. We want to find the next shelter before the sun sets. We alternate carrying the full water filter.
-   We get lost for a bit trying to find the trail. After going the wrong way for some time, we find our way.
-   We find a highway. Soren said that the shelter should be 1.5 miles past the highway so we are almost there!
-   We keep hiking at a good pace for 2 hours but never find the shelter. We keep thinking that we must be almost there, and keeping mistaking objects for the shelter, but it never comes. We are unsure if we already past is or what the deal is.
-   It is not getting very dark. Pitch black in fact. Thomas takes the lead with a headlight, and I am in back with a very bright bike light.
-   We are all thirstier than ever before. We finally stop and consume the water we have been carrying in the water filter. We wanted to wait till camb, but it looks like that isn't going to happen.
-   We drink some water and decide to stop for the night, thinking we passed the shelter (we hiked what must have been 5 miles).
-   We find a side trail named "lake loop" and follow it in search of water. The next day we realize that the a lake used to be there, but that it is all dried up.
-   The loop is longer than we thought. We aren't finding water and decide to stop and setup camp in the middle of a pitch black forest where we have no idea where we are. I think I may have been a bit grumpy.
-   We find a small patch off the trail. Not quite flat or root free but good enough.
-   We setup the tent. Everyone gets in. It smells horrible haha.
-   I find a bit of wtare left in my camel pack and devour it secretly without sharing haha. It's enough water for me to fall asleep.
-   Part of the reason we want to find a shelter so badly is that they have bear boxes where you can hide you food. In this case we leave our bags outside so that if a bear comes, at least it doesn't eat us, just our bags. We had really been manifesting a bear while walking in the dark, thinking any noise could be the bear coming.
-   Sleepytime.


# Day 3 {#day-3}

-   Wake up to Soren and Thomas.
-   We pack up the tent. I take my first poo and use the emergen wipes. Very peaceful to poo in the forest.
-   Hit the trail. 20 minutes later we fid the shelter. We were so close! Looking at the map we see that it was 5.5 miles from the highway after all, not 1.5...
-   We stop to fill up on water. There is a very nice stream with a grey pipe that makes filtering the water very easy despite the shallowness of the stream.
-   Cook some freeze dried food for breakfast. Tastes sooo good.
-   I setup the tripod and take some videos. We are having a good time, but then the phone runs out of battery unfortunately.
-   We hear moose noises.
-   Thomas discovers that he missplaced the charging cable so no more phone. I'm bummed cause it's too bad not to be able to take photos.
-   Everyone uses the mens. Mine is a bit messy. Flies are quick to attack. Thank God for emergen wipes lmao.
-   Hit the rode. We summit a very pretty forest. We almost set up the hammock but don't.
-   We find a gorge. It's beautiful.
-   We all swim around to cool off and clean our selves. The first somewhat deep swimming location. Water is cold but feels amazing. There are some tourists there because the gorge is about 5 minutes from road access, so we keep our underwear on.
-   We take lunch break #1. Spend some time patching up food blisters. They are quite bad.
-   We keep hiking and cross a highway.
-   We stop to fill up water at a stream. After the previous experiences, we do not want to be stuck without water again. We eat lunch break #2 at the stream. It is super relaxing.
-   We continue onwards and arrive at the shelter. It is still pretty early in the day with sunlight.
-   There is a beautiful privy and river.
-   We setup a campfire and get food ready. Then we take bathe in the shallow river. My blisters are not fans. Walking around bearfoot. The water is freezing, but we dry off by the fire.
-   We put our food in the lockable privy.
-   Relax by the fire, play some ukelele, and go to bed.
