org-content/hugo.org
*** Day 4

- Onwards. Everyone uses the privy.
- We hike up killington mountain. It's absolutely incredible. The tallest summit yet.
- There is a really cool shelter with bunk beds that we check out.
- We find another person. He thought we were bears or something.
- My joints are really starting to get angry with me. Doesn't like.
- Thomas thinks there might be a restaurant on top and begins manifesting it, desperate to find it, but Soren protests because it would cut into the daylight.
- Find a way to get higher by climbing a platform at the top. Kinda sketch, with a lot of floor boards missing, but we navigate our way up and enjoy the view.
- We cross a highway. There is a nice inn where backpackers can normally stop for a warm meal and bed, but it is closed because of Covid. We do take the opportunity to throw out whatever trash we had, and find a person with cute dogs which we pet.
- We keep hiking and find a nice overlook where we setup a hammock and relax. First round of popping blisters.
- We meet a stranger and chat with her a bit. Seems nice. She is on a mission to drive to hiking trails in 6 states or something like that.
- We find an official campsite. It has running water! What incredible technology!
- They have beach volley ball courts. We pretend to play without a ball. Good times.
- We keep going and find an awesome lake. Actually swimmable. It's a very hard choice to decide whether we stay here or keep going. Soren convinces us to make up the 2 remaining miles in the day tomorrow.
- We swim across the lake to an island in the middle. We are manifesting snapping turtles, but luckily none appear. There are some musical toads on the island in the middle. I lag behind because I'm afraid for my blisters, but I make it across. There are some kayakers. And a boy fishing. What a different life it would be to live out here.
- We come back and dry off while cooking food. We eat and then sleep. In the tent Thomas notices that some green stuff has invaded his blisters. He's not sure if they came from the lake or how they got there. He's a bit stressed about it, but Soren tells him not to worry about it (because Soren wants to go to sleep). We all go to bed.

*** Day 5

- We continue onwards. 
- Pass by some construction workers and try to ask them for some food, but either they completely ignored us, or couldn't hear us. It's chill though.
- We find a lake dock and walk out on it but it is somewhat falling apart and starts sinking as we walk out. Good times.
- We hike through an awesome forest with lots of big rocks.
- We stop at a river for a snack.
- There is a steep descent off a rock with a ladder to help you out. Soren just jumps down. No injury.
- I realize I lost my sleeping pad! I go back to look for it, but can't find it... Alas...
- We cross a bridge and find some old dudes chilling out by the river. They offer us some trail magic! Pretzels, doritos, lolly pops, and some other snacks. Very cool. They said that hikers were a lot less frequent because of Covid.
- I take the lead and go full speed up this mountain. I'm sweating like balls and exhausted but I just keep pushing. I keep telling myself 30 more steps. Soren and Thomas are barely keeping up and keep asking me to slow down, but I really just want to get to the top. The thing is that the top never comes haha. Eventually we stop for lunch before we reach the top, even though I protest, saying that we'll get a better view with which to eat lunch once we get to the top. It's chill though. Looking out at the forest is nice too.
- After lunch we keep going and we do reach the top. It's incredible! This is the highest summit so far I think.
- There is a shelter at the top of the mountain with a ladder to the roof. This shelter you can actually rent out, but it's open to backpackers when nobody is staying. It finally clicked why the trail to this shelter was so much more well maintained than the rest of the AT. I guess they don't want it to be too hard for the less intense people who rent out the shelter.
- We climb the ladder onto the roof. There are lots of bees on the top. We take some photos, and give each of our parents a call.
- Inside the cabin we find snickers, a pop tart, and pistachios! That snickers was the best snickers I've ever had.
- "leave behind nature valley". Not sure what this is.
- We go down the mountain and find the next shelter. Unfortunately we can't find any water nearby. Just a dried up river. We keep looking and I find some eventually a bit further downstream.
- We fill up all of our water packs and make dinner. Then we take it back to the shelter and eat there.
- We almost start a fire but decide to go to bed instead. We do a rotated sleeping pad strategy because I lost mine so we only have two left.

*** Day 6

- We pack up at shelter.
- I take a poo in the privy with the door open looking out onto all the trees.
- We hike for a while. We walk through a farm and find cows! They come right up to us and swarm us on all sides and really like being pet. They seem very interested in us. I was a bit afraid at first but in the end nobody got there fingers bit off. The cows had a bunch of flies in their eyes which was a bit unnerving, but it's cool.
- Eventually we continue fowards. We stop at a brooke and make a freeze dried lunch.
- Lots of breaks in the canopy today which makes everything much hotter than it already was.
- We roll down a hill.
- Giant mini forests where there are a bunch of plants that look like trees, but only go up to waste height. Really makes you feel like a giant.
- We stop in the forest and setup the hammock. Nice to relax. Soren and I finish off our peanut butter jars.
- I go in the hammock and it feels amazing.
- We keep going towards west hartford, the "big town" of the trip. We fantisize about what we'll find in the town.
- We find some trail magic sodas which gives us the sugar rush to climb up a mountain.
- We make it to the last road. This is the longest we walk on a road.
- We try to find a gas station or restaurant but fail to map food.
- We meet a friendly family who had just gone swimming and offers us some sodas. We ask if there is a gas station nearby but they say it is about 10 minutes by car which is wayy too far.
- We find a library with wifi, an ice cream store and a post office. The ice cream store is closed because of covid. The post office has the functionality of letting you ship yourself care packages as you hike along.
- We find a house with an "AT" sign on it. We check it out and find a friendly woman who gives us soda and says we can camp in her backyard for the night, and use her hose for tap water.
- We setup camp/tenta nd bring food and water to the river across the road. It's huge! By far the deepest.
- We find some locals bridge jumping. e join in. The water is very warm. Bridge jumping is awesome.
- After the bridge jumping we start making dinner. The locals find it funny that we are cooking food and spending the night at their local swimming location.
- They leave. We eat and washup with soap.
- Go to bed looking at the stars because we don't expect it to rain. Excited to see parents the next day.

