org-content/hugo.org
*** Day 7

- The last day. We get a bit lost, but eventually find our way. We are mostly walking on roads. Then mine and Soren's mom find us with the car. The timing was perfect. They brought loads of fast food which was incredible.
- We drive into town and eat lunch at a restaurant. Human food!
- We visit Soren's chilhood home.
- The plan is to stay one more night so the parents can camp with us. I am going back home, but Soren and Thomas are continuing for another week more!
- We camp next to a nice lake that Thomas and Soren will be starting from the next day. We don't go swimming, but walk around the perimeter. It's great. We see this dude with a drone.
- We go to bed. The next day Soren and Thomas continue forwards, and the rest of us head home. The drive home was very relaxing.

*** Reflections
- I keep reading the notes and can't believe how early in the trip they occurred. A similar thing happens when I take courses at school. I wonder why this is.
- We kept manifesting a bear, but it was irrational of us to be so afraid. The fear made the backpacking more fun in some ways though.
- We were surprised at how little wild life we saw. Our footsteps must have been load enough to scare them all away.
- It's incredible what a new experience you can have in such a short period of time. This was just one week, but it was experience like none I've ever had.
- I regret not taking a photo of the before and after backpack.
- I regret not taking more photos.
- I'm really glad I journaled throughout the trip. There's no way I would have remembered even a quarter of these things otherwise.
- We got very lucky with the weather. No rain the whole time.
- We Very rarely see people. Maybe one person a day on average.

*** COMMENT Notes

- My hiking boots starts falling apart. I think they might be built for fashion, not actually hiking.
- Eventually I leveled up from emergen wipes to fresh leaves.
- At nighttime Soren would read siddartha to us when falling asleep. Sometimes he would even read it while hiking!
- My joints get quite angry with me by the end.
- I have a tendancy to almost jog downhill, trying not to waste the potential energy. Also I found that it was easier on the joints. But Thomas and Soren aren't fans because there's a higher risk of falling over. I think I almost fall over a couple of times, but I never do.

Why post this on the blog?
- to show other people that I backpack.
- to inspire other people to backpack.
- to entertain. Problem with this is I don't think my recounting is especially engaging. I could make it more engaging if I put more time into it, but I don't know if that's what I want to spend time.
- to feel like my time spent writing this up wasn't wasted.
