content/posts/one-week-backpacking-trip/index.md


# Day 7 {#day-7}

-   The last day. We get a bit lost, but eventually find our way. We are mostly walking on roads. Then mine and Soren's mom find us with the car. The timing was perfect. They brought loads of fast food which was incredible.
-   We drive into town and eat lunch at a restaurant. Human food!
-   We visit Soren's chilhood home.
-   The plan is to stay one more night so the parents can camp with us. I am going back home, but Soren and Thomas are continuing for another week more!
-   We camp next to a nice lake that Thomas and Soren will be starting from the next day. We don't go swimming, but walk around the perimeter. It's great. We see this dude with a drone.
-   We go to bed. The next day Soren and Thomas continue forwards, and the rest of us head home. The drive home was very relaxing.


# Reflections {#reflections}

-   I keep reading the notes and can't believe how early in the trip they occurred. A similar thing happens when I take courses at school. I wonder why this is.
-   We kept manifesting a bear, but it was irrational of us to be so afraid. The fear made the backpacking more fun in some ways though.
-   We were surprised at how little wild life we saw. Our footsteps must have been load enough to scare them all away.
-   It's incredible what a new experience you can have in such a short period of time. This was just one week, but it was experience like none I've ever had.
-   I regret not taking a photo of the before and after backpack.
-   I regret not taking more photos.
-   I'm really glad I journaled throughout the trip. There's no way I would have remembered even a quarter of these things otherwise.
-   We got very lucky with the weather. No rain the whole time.
-   We Very rarely see people. Maybe one person a day on average.
